# Pandas
* 拓展了numpy的局限，包括
	* numpy中必须是homogeneous data
	* 不能使用查询函数（querying）		
		<!--% numpy array - pandas, entire table, and the related functionality. non-homogenou, support more operations-->


* 主要特点
	* 可以对Data Frames执行操作
	* 有查询功能	
	* 数据匹配（Data alignment）	
	* 时序功能
	* 可以处理缺失数据
* 数据格式: Series, DataFrame, and Panel

# Series

* 一维array,有label (数据类型homogeneous)
* label称为index <!-- % allows visualization and alignment, example of index: dates, IDs-->
* 初始化: from list, array, dictionary, series, or scalar
* 属性:  s1.index, s1.dtype, s1.values, s1.shape
* 选择:  s1[:3], s1['a']
* Series act as dictionaries:  'a' in s1 
* Series act as ndarrays:  np.sum(s1), 1/s1
* 默认的index is 0,1,...,length-1
* 插入:  s1['y']=0
* Null values: assigned by np.nan or None and represented as NaN
* 删除:  del s1['y'] (or slice a subset)

## 1. Series

In [20]:
# import package
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 初始化 Initialization

In [4]:
s1 = Series([10,  3,  7, 5], index=['a','b','c','d']) # from list; specify values and indexes
s1

a    10
b     3
c     7
d     5
dtype: int64

In [5]:
s2 = Series(np.array([10,  3,  7, 5]), index=['a','b','c','d']) # from array
s2

a    10
b     3
c     7
d     5
dtype: int32

In [6]:
s3 = Series({'a':10, 'b':3, 'c':7, 'd':5, 'e':6}) # from dictionary
s3

a    10
b     3
c     7
d     5
e     6
dtype: int64

### 属性 Attributes

In [7]:
s1.index # return index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
s1.dtypes # series type (one type per series)

dtype('int64')

In [9]:
s1.values # return values (as array)

array([10,  3,  7,  5], dtype=int64)

In [10]:
s1.shape # number of elements

(4,)

In [11]:
s1[:3] # select first 3 elements

a    10
b     3
c     7
dtype: int64

In [12]:
s1['a'] # get value whose index is 'a'

10

In [13]:
'a' in s1 # check if 'a' is an index of s1

True

### 与numpy的兼容性

In [14]:
np.sum(s1) # sum series; similar to numpy arrays

25

In [15]:
1/s1 # return new series whose values are inverse of the values in s1

a    0.100000
b    0.333333
c    0.142857
d    0.200000
dtype: float64

In [16]:
s1['x']=9 # set value of index 'x' (changes existing index or adds new one)
s1

a    10
b     3
c     7
d     5
x     9
dtype: int64

###  增加和删减值

In [17]:
s1['w']=np.inf # set value to infinity
s1['y']=None   # set value to null
s1['z']=np.nan # set value to NaN (Not a Number); more efficient than None (doesn't forces coversion of series to object)
s1

a      10
b       3
c       7
d       5
x       9
w     inf
y    None
z     NaN
dtype: object

In [18]:
s1.isnull() # check which elements are not numbers

a    False
b    False
c    False
d    False
x    False
w    False
y     True
z     True
dtype: bool

In [19]:
del s1['y'] # remove item
s1

a     10
b      3
c      7
d      5
x      9
w    inf
z    NaN
dtype: object

# 2. 标签整合 Label alignment

* Numpy arrays use vectorized operations

* series之间的运算联合了label/index
	* 例如: s1+s2
	* 新的index是两个series中label/index的合集
	* 如果某个series中没有某个label， 则相加后显示nan
	* s1.add(s2, fill\_value=0), (s1+s2).dropna()

In [22]:
s1 = Series([1,2,3],index=['a','b','c'])    # initialize s1
s2 = Series([40,30,20],index=['d','c','b']) # initialize s2
print('s1\n',s1,'\n') # print s1
print('s2\n',s2)      # print s2

s1
 a    1
b    2
c    3
dtype: int64

s2
 d    40
c    30
b    20
dtype: int64

In [23]:
s1+s2 # add two series

a     NaN
b    22.0
c    33.0
d     NaN
dtype: float64

In [24]:
s1.add(s2, fill_value=0) # handle missing values

a     1.0
b    22.0
c    33.0
d    40.0
dtype: float64

In [25]:
(s1+s2).dropna() # eliminate nan or null values

b    22.0
c    33.0
dtype: float64

# 3. DataFrame
* 用于替代 tables 
	* 可以涵盖多个同size的columns / Series
	* columns都是homogeneous
* [初始化](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dataframe): dict of arrays, lists or tuples; dict of series; dict of dicts; list of dicts or series; list of lists; from another dataframe
<!--%\item Attributes: df.index, df.dtypes, df.columns, df.values, df.shape-->
* 列的选择:  df['a']
* 加新的列:  df['new']=0, df['new']=df['a']+df['b'], df['new']=s, df['new']=[7,8,9], df.insert(3,'new',[10,11,12])
* 删除某些列:  del df['new']

## DataFrames - cont.

In [4]:
# initalize dataframe using dictionary of columns， different columns can be heterogeneous
data = {'a':[1,2,3], 'b':[1.1,-0.3,7], 'c':[True,False,True], 'd':['these','are','strings']}
df = DataFrame(data, index=['one','two','three'])
df

       a    b      c        d
one    1  1.1   True    these
two    2 -0.3  False      are
three  3  7.0   True  strings

In [21]:
# intialize dataframe using matrix representation (list of lists)
d = [[1 ,1.1 ,True ,'these'],[2 ,-0.3 ,False,'are'],[3 ,7.0 ,True ,'strings']]
DataFrame(data=d, columns=['a','b','c','d'],index=['one','two','three'])

       a    b      c        d
one    1  1.1   True    these
two    2 -0.3  False      are
three  3  7.0   True  strings

## DataFrames - cont.

In [8]:
df.index # return index

Index(['one', 'two', 'three'], dtype='object')

In [9]:
df.dtypes # return the type of each column

a      int64
b    float64
c       bool
d     object
dtype: object

In [10]:
df.columns # return columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [12]:
df.values # return table values without column header or index

array([[1, 1.1, True, 'these'],
       [2, -0.3, False, 'are'],
       [3, 7.0, True, 'strings']], dtype=object)

## DataFrames - cont.

In [13]:
df.shape # number of rows and columns of dataframe

(3, 4)

In [ ]:
df['a'] # extract column as series

In [ ]:
df['new']=5 # add new column
df

In [ ]:
df['new']=df['a']+df['b'] # new column is the sum of two existing columns
df

In [ ]:
del df['new'] # remove column
df

In [5]:
s = Series([100, 300, 400], index=['one','three','four'])
df['new from series']=s # create column from series (aligns indexes)
df

       a    b      c        d  new from series
one    1  1.1   True    these            100.0
two    2 -0.3  False      are              NaN
three  3  7.0   True  strings            300.0

In [8]:
df['new from list']=[7,8,9] # list/array must be of the same length
df

       a    b      c        d  new from series  new from list
one    1  1.1   True    these            100.0              7
two    2 -0.3  False      are              NaN              8
three  3  7.0   True  strings            300.0              9

# 4. 挖掘Series and DataFrames的使用方法
* 基本可挖掘信息: df.shape, df.index, df.dtypes, df.values, df.columns (DataFrame only) 
* df.info()
* Print first and last rows:  df.head(5), df.tail(5)
* 描述性统计量 Descriptive statistics: 
	* df.describe() <!--%- may filter columns by type and customize quantiles-->
	* 例如:  df.sum(), df.mean(), df.std(), df.quantile()
	* 排除所有null值
	* 另有:  count, min, max, abs, prod, cumsum, cumprod,...
	* Index of max/min values: df.idxmin(), df.idxmax()
	* 计算频次:  s.value_counts()

### Exploring series

In [9]:
df.info() # infromation about dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, one to three
Data columns (total 6 columns):
a                  3 non-null int64
b                  3 non-null float64
c                  3 non-null bool
d                  3 non-null object
new from series    2 non-null float64
new from list      3 non-null int64
dtypes: bool(1), float64(2), int64(2), object(1)
memory usage: 147.0+ bytes

In [10]:
df.head(2) # returns a dataframe holding the first two rows

     a    b      c      d  new from series  new from list
one  1  1.1   True  these            100.0              7
two  2 -0.3  False    are              NaN              8

In [11]:
df.tail(2) # returns a dataframe holding the last two rows

       a    b      c        d  new from series  new from list
two    2 -0.3  False      are              NaN              8
three  3  7.0   True  strings            300.0              9

In [12]:
df.describe() # statistical summary (of numeric values only)

         a         b  new from series  new from list
count  3.0  3.000000         2.000000            3.0
mean   2.0  2.600000       200.000000            8.0
std    1.0  3.874274       141.421356            1.0
min    1.0 -0.300000       100.000000            7.0
25%    1.5  0.400000       150.000000            7.5
50%    2.0  1.100000       200.000000            8.0
75%    2.5  4.050000       250.000000            8.5
max    3.0  7.000000       300.000000            9.0

In [13]:
s = Series(np.random.randint(1,101,1000)) # create a series with 1000 random integers between [1,100]
s.head(5)

0    45
1    70
2    66
3    18
4    90
dtype: int64

In [14]:
s.describe() # describe works for both dataframes and series

count    1000.00000
mean       51.34400
std        27.61094
min         1.00000
25%        28.00000
50%        52.00000
75%        74.00000
max       100.00000
dtype: float64

In [15]:
s.sum() # sum series

51344

In [16]:
s.std() # standard deviation of series values

27.610940368412443

In [17]:
s.value_counts() # counts frequency of each value; sorts by frequency

24     20
47     17
89     17
26     16
86     15
       ..
100     5
53      4
34      4
98      3
3       3
Length: 100, dtype: int64

# 5. [Indexing](http://pandas.pydata.org/pandas-docs/stable/indexing.html)

* 类似于numpy 但是类型不同 
* 通过label进行选择 (.loc)
	* Series: s.loc['Alice'], s.loc[['Alice','Davice']], s.loc['Alice':'James'] (inclusive!), s['Alice']
	* DataFrame: df.loc['Alice'], df.loc[['Alice','David']], df.loc['Alice':'James'], df.loc['Alice':'James',['age','country']]
* 通过位置进行选择 (.iloc)
	* Series: s.iloc[2], s.iloc[:2], s.iloc[[0,3]]
	* DataFrame: df.iloc[0], df.iloc[0,1], df.iloc[1:3,1:3], df.iloc[[0,3],[1,2]]	
* 通过布尔值（判断条件）进行选择 (.loc): s.loc[$s<30$], df.loc[df.age>30]
* Operator[ ]: 使用operator时，直观更容易理解，但是计算效率低于 .loc and .iloc

### Indexing

In [22]:
data = {'grade':[90, 80, 75, 95],
        'age':[25,40,35,32],
        'country':['Mexico','USA','Canada','Bolivia'],
        'major':['Computer science','Electrical engineering','Biology','Political science']}

df = DataFrame(data,index=['Alice','Bob','James','David']) # initialize dataframe
print(df)

       grade  age  country                   major
Alice     90   25   Mexico        Computer science
Bob       80   40      USA  Electrical engineering
James     75   35   Canada                 Biology
David     95   32  Bolivia       Political science

In [23]:
s = df.age # equivalent to s = df['age']
print(s)

Alice    25
Bob      40
James    35
David    32
Name: age, dtype: int64

### Selection by label (series)

In [24]:
s.loc['Alice'] # return value corresponding to the index Alice

25

In [26]:
s.loc[['Alice','David']] # return values corresponding to indexes Alice and David

Alice    25
David    32
Name: age, dtype: int64

### Selection by label (dataframes)

In [27]:
df.loc['Alice'] # similar to series, only now returns a series for the corresponding row

grade                    90
age                      25
country              Mexico
major      Computer science
Name: Alice, dtype: object

In [28]:
type(df.loc['Alice'])

pandas.core.series.Series

In [29]:
df.loc[['Alice','David']] # return multiple rows

       grade  age  country              major
Alice     90   25   Mexico   Computer science
David     95   32  Bolivia  Political science

In [30]:
df.loc[['Alice','James'],['age','country']] # filter rows and columns

       age country
Alice   25  Mexico
James   35  Canada

### Selection by position (series)

In [31]:
print(s)

Alice    25
Bob      40
James    35
David    32
Name: age, dtype: int64

In [32]:
s.iloc[2] # returns 3rd element

35

In [33]:
s.iloc[:2] # exclusive (index 2 is not included)

Alice    25
Bob      40
Name: age, dtype: int64

In [34]:
s.iloc[[0,3]] # returns rows 0 and 3

Alice    25
David    32
Name: age, dtype: int64

### Selection by position (dataframe)

In [35]:
print(df) # reminder for dataframe values

       grade  age  country                   major
Alice     90   25   Mexico        Computer science
Bob       80   40      USA  Electrical engineering
James     75   35   Canada                 Biology
David     95   32  Bolivia       Political science

In [36]:
df.iloc[0] # equivalent to df.iloc[0,:]

grade                    90
age                      25
country              Mexico
major      Computer science
Name: Alice, dtype: object

In [37]:
df.iloc[0,1] # return value in row 0, column 1

25

In [38]:
df.iloc[1:3,1:3] # return range of values; exclusive (row and column 3 are excluded)

       age country
Bob     40     USA
James   35  Canada

In [39]:
df.iloc[[0,3],[1,2]] # rows 0,3 and columns 1,2

       age  country
Alice   25   Mexico
David   32  Bolivia

### Selection by boolean array

In [40]:
s

Alice    25
Bob      40
James    35
David    32
Name: age, dtype: int64

In [41]:
s>30

Alice    False
Bob       True
James     True
David     True
Name: age, dtype: bool

In [42]:
# return values in series that are greater than 30
# first s>30 is computed, then s is filtered accordingly
s.loc[s>30]

Bob      40
James    35
David    32
Name: age, dtype: int64

In [43]:
df.loc[df.age>30] # same for dataframe

       grade  age  country                   major
Bob       80   40      USA  Electrical engineering
James     75   35   Canada                 Biology
David     95   32  Bolivia       Political science

In [44]:
df.loc[df.index.isin(['David','Alice'])] # df.index.isin(['David','Alice']) returns a binary series

       grade  age  country              major
Alice     90   25   Mexico   Computer science
David     95   32  Bolivia  Political science

### Operator[ ]
* Invokes iloc/loc (slower than directly using iloc/loc)

In [45]:
df[df['age']<30] # indexing using a boolean vector

       grade  age country             major
Alice     90   25  Mexico  Computer science

In [46]:
df[['age','country']] # extracts columns

       age  country
Alice   25   Mexico
Bob     40      USA
James   35   Canada
David   32  Bolivia

In [47]:
s = df.age
s

Alice    25
Bob      40
James    35
David    32
Name: age, dtype: int64

In [48]:
s['Alice']

25

In [49]:
s[-1]

32

In [18]:
s = Series([10,11,12],index=[100,101,102]) # expect error - when index is numeric, the operator [] uses index value rather than location
s

100    10
101    11
102    12
dtype: int64

In [19]:
s[1] # ambiguity about using index values or position

KeyError: 1

### Operator[ ] - cont.

# 练习 1

创建一个 4x5 的array，值为1到20. 用这个array初始化一个 DataFrame，具有类似的维度，且其column名称为a,b,c,d,e, 其index为w,x,y,z.
1.  输出index为 "y" 的行
2.  数据名为 "e" 的列
3.  输出第二行
4.  输出第三列
5.  输出 DataFrame 中column为 a，d的两列, 每列涵盖w-y的indices

In [ ]:
# write solution here

<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
___

# 6. 整合 Series and DataFrames - [Merge](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html)

* 类似于 SQL 的整合指令 - matches all records from two DataFrames that share key 
* Merge/join types: outer, inner, left, right
* 基于列的融合:	pd.merge(df1, df2, on="key", how="inner") 
* 基于行的融合: pd.merge(df1, df2, left_index=True, right_index=True, how="outer")
* Specify suffixes, column names, multiple columns or indices, mix index and column, sort, source indicator

### 示例

In [61]:
df_items = pd.read_csv("data/items.csv")
df_items

   SKU  price currency
0    1   5.99      USD
1    2  49.99      GBP
2    3  89.99      JPY
3    4  24.99      DZD

In [62]:
df_rates = pd.read_csv("data/exchange_rates_oct18.csv")
df_rates

                   Currency Code  USD/1Unit  Units/1USD
0            Andorran Franc  ADF   0.167500      5.9707
1           Andorran Peseta  ADP   0.006604    151.4490
2    Utd. Arab Emir. Dirham  AED   0.272300      3.6739
3       Afghanistan Afghani  AFN   0.015210     65.9474
4              Albanian Lek  ALL   0.008127    126.4200
..                      ...  ...        ...         ...
191          Yugoslav Dinar  YUN   0.008950    112.4360
192      South African Rand  ZAR   0.070240     14.2636
193          Zambian Kwacha  ZMK   0.000193   5328.9000
194         Zambian  Kwacha  ZMW   0.101200      9.9729
195         Zimbabwe Dollar  ZWD   0.002679    376.3000

[196 rows x 4 columns]

In [63]:
df_merged = pd.merge(df_items, df_rates, how='left', left_on="currency", right_on="Code") # SCREENSHOT
df_merged

   SKU  price currency        Currency Code  USD/1Unit  Units/1USD
0    1   5.99      USD       US Dollar  USD   1.000000      1.0000
1    2  49.99      GBP   British Pound  GBP   1.217200      0.8217
2    3  89.99      JPY    Japanese Yen  JPY   0.009608    104.0950
3    4  24.99      DZD  Algerian Dinar  DZD   0.009093    110.8920

In [64]:
df_merged['Sales (USD)']=df_merged['price']*df_merged['USD/1Unit']
df_merged

,SKU,price,currency,Currency,Code,USD/1Unit,Units/1USD,Sales (USD)
0,1,5.99,USD,US Dollar,USD,1.000000,1.0000,5.990000
1,2,49.99,GBP,British Pound,GBP,1.217200,0.8217,60.847828
2,3,89.99,JPY,Japanese Yen,JPY,0.009608,104.0950,0.864624
3,4,24.99,DZD,Algerian Dinar,DZD,0.009093,110.8920,0.227234

In [65]:
df_merged['Sales (USD)'].sum()

67.92968599

### Join types

In [66]:
df1 = DataFrame({"A":["A0","A1","A2"], "B":["B0","B1","B2"], "key":['k0','k1','k2']})
df2 = DataFrame({"C":["C0","C1","C3"], "D":["D0","D1","D3"], "key":['k0','k1','k3']})
print(df1,'\n')
print(df2,'\n')
print(pd.merge(df1, df2, on="key", how="inner")) # SCREENSHOT: only rows with keys that exist in both df1 and df2

    A   B key
0  A0  B0  k0
1  A1  B1  k1
2  A2  B2  k2

    C   D key
0  C0  D0  k0
1  C1  D1  k1
2  C3  D3  k3

    A   B key   C   D
0  A0  B0  k0  C0  D0
1  A1  B1  k1  C1  D1

注意 
- inner, outer, left, right joins (请自主查找其他例子)
- merge by indexes (instead of columns)
- adding suffixes

In [67]:
pd.merge?

# 7. 整合Series and DataFrames - [Concatenate](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html)

* 将小一些的DataFrames联合为一个大的DataFrame(vertically or horizontally)
* Vertically:  pd.concat([df1,df2],axis=0)
* Horizontally:   pd.concat([df1,df2],axis=1)
* 并或交不同的columns/indices (with 'join'), 增加新的index(with 'keys')
* 可以用于Series （注意 merge只能用于dataframes）
<BR>
* 与merge的对比:
  * merge - operates on columns, cartesian product 笛卡尔积
  * concat - placing/aligning dataframes next or after another

### Vertical concatenation

In [68]:
df1 = DataFrame({"A":["A0","A1","A2"], "B":["B0","B1","B2"]})
df2 = DataFrame({"A":["A3","A4","A5"], "B":["B3","B4","B5"]})
print(df1,"\n",df2)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
     A   B
0  A3  B3
1  A4  B4
2  A5  B5

In [69]:
pd.concat([df1,df2],axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5

In [70]:
# restart index
pd.concat([df1,df2],axis=0,ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5

In [71]:
# Vertical concatenation when column names do not match
df3 = DataFrame({"A":["A0","A1","A2"], "B":["B0","B1","B2"]})
df4 = DataFrame({"A":["A3","A4","A5"], "C":["C3","C4","C5"]})
print(df3,"\n",df4)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
     A   C
0  A3  C3
1  A4  C4
2  A5  C5

In [72]:
# return columns that exist in both dataframes
pd.concat([df3,df4],axis=0,join='inner')

    A
0  A0
1  A1
2  A2
0  A3
1  A4
2  A5

In [73]:
# return columns that exist either dataframes
pd.concat([df3,df4],axis=0,join='outer')

F:\Jupyter\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

    A    B    C
0  A0   B0  NaN
1  A1   B1  NaN
2  A2   B2  NaN
0  A3  NaN   C3
1  A4  NaN   C4
2  A5  NaN   C5

其他
- Horizontal concatenation (类似于 merge 但要求unique的index values; 请参见参考书)

# 练习 2

‘data’文件夹中存储了学生成绩，见于 grades1.csv, grades2.csv, grades3.csv  
1. 用 pandas read_csv 指令将每个文件加载于一个独立的DataFrame中 (e.g., pd.read_csv("data/grades1.csv"))
2. 输出所有 DataFrames 
3. 将数据整合为一个dataframe

In [74]:
# write solution here

<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
___

# 8. [GroupBy ](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html) and [Pivot tables 数据透视表](http://pandas.pydata.org/pandas-docs/version/0.18.1/generated/pandas.pivot_table.html)

* Aggregation tool: creates a summary table by specifying which columns become the indexes and columns of the new table
		
* Example:  pd.pivot_table(data=adult, index='education', columns='sex', values='over50k', aggfunc=np.mean)
		 
* Other features: multiple columns on each axis, multiple functions
		
* Stacking: pivoting columns to indexes 
		
* Unstacking: pivoting indexes to columns

In [81]:
# Data source: http://archive.ics.uci.edu/ml/datasets/Adult
adult = pd.read_csv("data/adult.data", 
                    names=['age','workclass','fnlwgt','education','education-num','marital-status','occupation','relationship','race','sex','capital-gain','capital-loss','hours-per-week','native-country','income'],
                    skipinitialspace=True)

In [82]:
adult.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

__Motivation__: breakdown income by demographics

In [83]:
adult['over50k']=np.array(adult['income']=='>50K',dtype='int')
adult.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income,over50k
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,0
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,0
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,0
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,0
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,0

In [84]:
adult.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week,over50k
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456,0.240810
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429,0.427581
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000,0.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000,0.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000,0.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000,0.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000,1.000000

In [85]:
adult.groupby('education').agg(np.mean)['over50k']

education
10th            0.066452
11th            0.051064
12th            0.076212
1st-4th         0.035714
5th-6th         0.048048
7th-8th         0.061920
9th             0.052529
Assoc-acdm      0.248360
Assoc-voc       0.261216
Bachelors       0.414753
Doctorate       0.740920
HS-grad         0.159509
Masters         0.556587
Preschool       0.000000
Prof-school     0.734375
Some-college    0.190235
Name: over50k, dtype: float64

In [86]:
adult.groupby(['education','sex']).agg(np.mean)['over50k']

education     sex
10th          Female    0.010169
              Male      0.092476
11th          Female    0.018519
              Male      0.069987
12th          Female    0.027778
              Male      0.100346
1st-4th       Female    0.000000
              Male      0.049180
5th-6th       Female    0.023810
              Male      0.056225
7th-8th       Female    0.006250
              Male      0.080247
9th           Female    0.034722
              Male      0.059459
Assoc-acdm    Female    0.133017
              Male      0.323529
Assoc-voc     Female    0.134000
              Male      0.333333
Bachelors     Female    0.209389
              Male      0.503747
Doctorate     Female    0.581395
              Male      0.782875
HS-grad       Female    0.066667
              Male      0.203769
Masters       Female    0.333955
              Male      0.657119
Preschool     Female    0.000000
              Male      0.000000
Prof-school   Female    0.456522
              Male      0.787190
Some-college  Female    0.070207
              Male      0.265329
Name: over50k, dtype: float64

In [87]:
pd.pivot_table(data=adult, index='education', columns='sex', values='over50k', aggfunc=np.mean)

sex             Female      Male
education
10th          0.010169  0.092476
11th          0.018519  0.069987
12th          0.027778  0.100346
1st-4th       0.000000  0.049180
5th-6th       0.023810  0.056225
7th-8th       0.006250  0.080247
9th           0.034722  0.059459
Assoc-acdm    0.133017  0.323529
Assoc-voc     0.134000  0.333333
Bachelors     0.209389  0.503747
Doctorate     0.581395  0.782875
HS-grad       0.066667  0.203769
Masters       0.333955  0.657119
Preschool     0.000000  0.000000
Prof-school   0.456522  0.787190
Some-college  0.070207  0.265329

In [89]:
# aggregate using multiple functions 
pd.pivot_table(data=adult, index='education', columns='sex', values='over50k', aggfunc=[np.mean, len]) #len表示计数 
#对上述指令，可以参考 https://www.jianshu.com/p/e8f6b4fad119 多用于量化投资

                  mean              len
sex             Female      Male Female  Male
education
10th          0.010169  0.092476    295   638
11th          0.018519  0.069987    432   743
12th          0.027778  0.100346    144   289
1st-4th       0.000000  0.049180     46   122
5th-6th       0.023810  0.056225     84   249
7th-8th       0.006250  0.080247    160   486
9th           0.034722  0.059459    144   370
Assoc-acdm    0.133017  0.323529    421   646
Assoc-voc     0.134000  0.333333    500   882
Bachelors     0.209389  0.503747   1619  3736
Doctorate     0.581395  0.782875     86   327
HS-grad       0.066667  0.203769   3390  7111
Masters       0.333955  0.657119    536  1187
Preschool     0.000000  0.000000     16    35
Prof-school   0.456522  0.787190     92   484
Some-college  0.070207  0.265329   2806  4485

# 练习 3

The file "data/iris.data" is one of the most well known datasets, which contains information about the Iris plant. Each row represent an iris, and the columns represent the following attributes: sepal length, sepal width, petal length, petal width, and the class.
1. Construct a DataFrame holding the average value of each attribute per class
2. Construct a DataFrame holding the minimal, average, and maximal values of each attribute per class

Soure: http://archive.ics.uci.edu/ml/datasets/Iris

In [ ]:
# write solution here

<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
___

# 9. 混合整合 Miscellaneous
* Alignment - cont.
  * DataFrames and Series are aligned <!--% no need to sort-->		
* 可以处理数据缺失问题
  * np.nan， None 均代表缺失值
  * Series: isnull(), isnotnull()
  * 替换缺失值: df.fillna(0)
  * 删除带有缺失值的行: df.dropna() 

若有兴趣，请翻阅参考书目

# 10. Split-Apply-Combine using [GroupBy](http://pandas.pydata.org/pandas-docs/stable/groupby.html)  * (if time permits)

* 作用：calculate statistics for each age group, or fit a regression model for each sub-group
* split()
	* 基于column 'A'将一个DataFrame df 拆分为小的DataFrames -  grouped=df.groupby("A") 
	* 自定义拆分标准:  df.groupby([8,9,8,9,8,9])
	*  df.groupby("A") 等价于 df.groupby(df['A']) 
	* 主要特点: iterate over all groups, split by multiple keys, retrieve specific group ( grouped.get\_group('y')), split based on columns or rows	
* filter(): filter out groups from dataframes
* agg(): applies aggregating function on each group and concatenates them into a single dataframe. Example:  df.groupby("A").agg(np.sum) <!--%, multiple aggregating functions, different functions for each column-->
* apply(): converts groups into dataframes and concatenates them to a single dataframe:  df.groupby('course').apply(lambda d:d.describe())

### Split using groupby

In [90]:
df = DataFrame({"student":["Alice","Alice","Alice","Bob","Bob","Bob"],
                "course":['C1','C2','C3','C1','C2','C3'],
                "hw1":[80,70,90,95,84,60],
                "hw2":[80,90,85,70,100,80],
                "exam":[90,100,60,87,94,88],
                "final":list("AABAAA")},columns=["student","course","hw1","hw2","exam","final"])
df

  student course  hw1  hw2  exam final
0   Alice     C1   80   80    90     A
1   Alice     C2   70   90   100     A
2   Alice     C3   90   85    60     B
3     Bob     C1   95   70    87     A
4     Bob     C2   84  100    94     A
5     Bob     C3   60   80    88     A

In [91]:
# Split by student
grouped = df.groupby('student')

# Conceptually, each group is a dictionary of keys and DataFrames. 
for k,d in grouped:
    print('key:',k)
    print(d,'\n')

key: Alice
  student course  hw1  hw2  exam final
0   Alice     C1   80   80    90     A
1   Alice     C2   70   90   100     A
2   Alice     C3   90   85    60     B

key: Bob
  student course  hw1  hw2  exam final
3     Bob     C1   95   70    87     A
4     Bob     C2   84  100    94     A
5     Bob     C3   60   80    88     A

In [92]:
# Split by course
grouped = df.groupby('course')

for k,d in grouped:
    print('key:',k)
    print(d,'\n')

key: C1
  student course  hw1  hw2  exam final
0   Alice     C1   80   80    90     A
3     Bob     C1   95   70    87     A

key: C2
  student course  hw1  hw2  exam final
1   Alice     C2   70   90   100     A
4     Bob     C2   84  100    94     A

key: C3
  student course  hw1  hw2  exam final
2   Alice     C3   90   85    60     B
5     Bob     C3   60   80    88     A

In [93]:
# get specific group
grouped = df.groupby('course')
grouped.get_group('C2') # equivalent to df[df['course']=='C2']

  student course  hw1  hw2  exam final
1   Alice     C2   70   90   100     A
4     Bob     C2   84  100    94     A

In [94]:
df

  student course  hw1  hw2  exam final
0   Alice     C1   80   80    90     A
1   Alice     C2   70   90   100     A
2   Alice     C3   90   85    60     B
3     Bob     C1   95   70    87     A
4     Bob     C2   84  100    94     A
5     Bob     C3   60   80    88     A

### Filtering groups

In [95]:
# filter out groups
def f(df_):
    # returns true if the average exam grade in a grades dataframe is above 85
    return(np.mean(df_['exam'])>85)

df.groupby('course').filter(f) # equivalently: df.groupby('course').filter(lambda df_:np.mean(df_['exam'])>85)

  student course  hw1  hw2  exam final
0   Alice     C1   80   80    90     A
1   Alice     C2   70   90   100     A
3     Bob     C1   95   70    87     A
4     Bob     C2   84  100    94     A

# 11. 本章总结

* Numpy
  - Arrays (creating, vectorized operations, manipulating)
  - Mathematical libraries (algebra, probability)
* pandas
  - Series and DataFrames
  - Querying, splitting, merging, concatenating, pivoting, cleaning

# 参考阅读材料

* Python for Data Analysis by William Wesley McKinney (numpy, pandas and visualization)
* Numerical computations:  [NumPy documentation](http://docs.scipy.org/doc/numpy/), [SciPy documentation](http://docs.scipy.org/doc/scipy/reference/), [Symbolic computation](http://www.sympy.org/en/index.html)
* pandas: [Online documentation](http://pandas.pydata.org/pandas-docs/stable/)